# Data Operation with Pandas

## DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
rows = [
    ['Nissan', 'Stanza', 1991, 138, 4, 'MANUAL', 'sedan', 2000],
    ['Hyundai', 'Sonata', 2017, None, 4, 'AUTOMATIC', 'Sedan', 27150],
    ['Lotus', 'Elise', 2010, 218, 4, 'MANUAL', 'convertible', 54990],
    ['GMC', 'Acadia', 2017, 194, 4, 'AUTOMATIC', '4dr SUV', 34450],
    ['Nissan', 'Frontier', 2017, 261, 6, 'MANUAL', 'Pickup', 32340]
]


columns = [
    'Make', 'Model', 'Year', 'Engine HP', 'Engine Cylinders', 'Transmission Type', 'Vehicle_Style', 'MSRP' 
]

In [3]:
# help(pd.DataFrame)

df = pd.DataFrame(data=rows, columns=columns)
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [4]:
df.head(n=3)

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990

## Series -

In [5]:
df.Make  

df.Model

df[['Make', 'Model', 'Year', 'Engine HP']]

      Make     Model  Year  Engine HP
0   Nissan    Stanza  1991      138.0
1  Hyundai    Sonata  2017        NaN
2    Lotus     Elise  2010      218.0
3      GMC    Acadia  2017      194.0
4   Nissan  Frontier  2017      261.0

In [6]:
df['ide'] = [2,3,4,5,6]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,2
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,3
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,4
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,5
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,6

In [7]:
del df['ide']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

In [8]:
df['ide'] = ['a' , 'b', 'c', 'd', 'e']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,a
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,b
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,c
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,d
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,e

In [9]:
df['ide'] = [1,2,3,4,5]
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP,ide
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000,1
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150,2
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990,3
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450,4
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340,5

In [10]:
del df['ide']
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Index

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
df.Make.index

RangeIndex(start=0, stop=5, step=1)

# iloc - Integer based location

In [37]:
df.iloc[0,6]   #integer-based location -

'sedan'

In [42]:
type(df.iloc[0,6])

str

In [40]:
df.iloc[0:3, 0:3]

      Make   Model  Year
0   Nissan  Stanza  1991
1  Hyundai  Sonata  2017
2    Lotus   Elise  2010

In [41]:
type(df.iloc[0:3, 0:3])

pandas.core.frame.DataFrame

In [52]:
df.iloc[[1]] #label based location
#This returns a dataframe or 2D array

# If you're feeding rows into a modeling pipeline or want to keep the structure intact (e.g., for .concat() or .merge()), use df.iloc[[1]]

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150

In [48]:
type(df.iloc[[1]])

pandas.core.frame.DataFrame

In [53]:
df.iloc[1] # selects integer location -- integer based location

#this returns a 1 series or 1D array

# This is mainly used when inspecting for inspecting or manipulating values.

Make                   Hyundai
Model                   Sonata
Year                      2017
Engine HP                  NaN
Engine Cylinders             4
Transmission Type    AUTOMATIC
Vehicle_Style            Sedan
MSRP                     27150
Name: 1, dtype: object

In [51]:
type(df.iloc[1])

pandas.core.series.Series

# loc - label based location

In [85]:
Rows = [
    ["person 2", "kofi", 28, "male", "Honda"],
    ["person 3", "ama", 24, "female", "Toyota"],
       ]

Columns = [
    ["identifier", "name", "age", "sex", "car"]
]


df2 = pd.DataFrame(data = Rows, columns=Columns)
df2

  identifier  name age     sex     car
0   person 2  kofi  28    male   Honda
1   person 3   ama  24  female  Toyota

In [86]:
df2.index = ["info1", "info2"]
df2

      identifier  name age     sex     car
info1   person 2  kofi  28    male   Honda
info2   person 3   ama  24  female  Toyota

In [87]:
print(df2.columns.tolist())

[('identifier',), ('name',), ('age',), ('sex',), ('car',)]

In [101]:
df2.loc[['info1', 'info2'],:]

      identifier  name age     sex     car
info1   person 2  kofi  28    male   Honda
info2   person 3   ama  24  female  Toyota

In [138]:
df2.loc[:,['identifier', 'name']]

      identifier  name
info1   person 2  kofi
info2   person 3   ama

In [109]:
type(df2.loc[['info1', 'info2']])

pandas.core.frame.DataFrame

In [103]:
df2.loc[['info1', 'info2'],['identifier','sex']]

      identifier     sex
info1   person 2    male
info2   person 3  female

In [127]:
#We want to select continuos columns using loc. 

# But loc have to order the columns alphabetically inorder to do it successfully
df3 = df2.sort_index(axis=1)  #--columns sorted here
print(df3.columns.tolist())  #--verify

df3.loc[:, 'age':'name'] #-- now reselect based on ordering

#df2.loc[:,'identifier':'sex']

[('age',), ('car',), ('identifier',), ('name',), ('sex',)]

      age     car identifier  name
info1  28   Honda   person 2  kofi
info2  24  Toyota   person 3   ama

In [135]:
df3.columns.is_monotonic_increasing  #confirm the alphabetical order

True

In [128]:
df3.loc[['info1'],'age':"sex"]

      age    car identifier  name   sex
info1  28  Honda   person 2  kofi  male

In [129]:
df3.loc[:, 'identifier':'sex']

      identifier  name     sex
info1   person 2  kofi    male
info2   person 3   ama  female

In [133]:
#print(type(df3.columns))
# Output: <class 'pandas.core.indexes.multi.MultiIndex'>
df3.columns.is_monotonic_increasing

True

In [143]:
df3 = df3.reset_index(drop=True)

In [144]:
df3

  age     car identifier  name     sex
0  28   Honda   person 2  kofi    male
1  24  Toyota   person 3   ama  female

In [141]:
df

,Make,Model,Year,Engine HP,Engine Cylinders,Transmission Type,Vehicle_Style,MSRP
0,Nissan,Stanza,1991,138.0,4,MANUAL,sedan,2000
1,Hyundai,Sonata,2017,NaN,4,AUTOMATIC,Sedan,27150
2,Lotus,Elise,2010,218.0,4,MANUAL,convertible,54990
3,GMC,Acadia,2017,194.0,4,AUTOMATIC,4dr SUV,34450
4,Nissan,Frontier,2017,261.0,6,MANUAL,Pickup,32340

# Accessing Elements

# Element Wise Operation

# Filtering

# String Operation

# Summarizing Operations

# Missing Values

# Grouping

# Getting Numpy Arrays